{
	"publisher_id": 0,
	"publisher_package_id": 3337,
	"title": "uScript Visual Scripting Tool",
	"description": "Purchase uScript now for <strong>half price</strong> (50% off) while it is still in beta. <strong>Now with real-time visual debugging!</strong>\n<br><br>\n<a href=\"http://www.detoxstudios.com/PLE\">Click here to try the Personal Learning Edition for free.</a>\n<br><br>\nCreated by game development veterans, uScript is easy to use while containing the power and flexibility for entire teams to create professional products. uScript will dramatically improve your ability to rapidly prototype, iterate, and bring your ideas to life. For more information, join us on the <a href=\"http://uscript.net\">uScript Community Website!</a>",
	"changes": "Retail Beta 13\nFebruary 5th, 2012\n\nSeveral bug fixes, updates and new nodes.\n\n! - Important note: When you upgrade to this build, you may see Unity compile errors of your uScript's generated script files. Because of some of the nodes that have been updated, if you are using them in your graph you will need to delete the generated script files and rebuild them in uScript. For instructions on this, please see the following documentation: Deleting Generated Code Files and Rebuilding Them\n\nUpdates:\n* Provide feedback and cleanly handle when the context menu and node palette menu failed to initialize.\n* Ability for events in a nested script to hook up to nodes which have immediate outputs.\n* Added the \"Upgrade Deprecated Nodes\" to the File Menu. This will auto-update all \"pink\" nodes in the open uScript graph. Please note that the updated versions of a given node may change it's data type and that manual re-connection of different data/variable types may be required. Be sure to inspect your graphs for proper operation if using this method to mass-update nodes.\n\nUpdated Nodes:\n* Look At - added the ability to lock a specific axis.\n* Print Text - added remove time parameter to remove the text automatically after a set period of time.\n* Set Rigidbody Velocity - fixed bug in SetRigidBodyVelocity where the incorrect component was checked thus causing the check to fail and the node would not execute as intended.\n* Linear Interpolate Quaternion - changed Quaternion Lerp to use Quaternion.Lerp instead of Vector4.Lerp.\n* Compare GameObjects - added check for null game objects.\n\nNew Nodes:\n* Camera Fade\n* Move To Location (Relative)\n* Set Main Texture Scale\n* TextAsset To String\n\nBug Fixes:\n* Fixed uScript editor \"Texture 2D leaked\" bug.\n* Fixed an issue where uScriptGUIStyles were being initialized more than once on pre-3.5 Unity builds.\n* Fixed code gen bug where nested enum types used the '+' sign instead of '.'\n* Fixed Index Out of Range when starting Unity with uScript open.\n* Fixed issue where iOS won't build because of debug breakpoint code.\n* Fixed issue where RemoveGeneratedCode wouldn't always properly stub out logic scripts with empty events.\n* Fixed issue loading older nodes without valid logic event arguments.",
	"version_name": "0.9.1661",
	"category": 110,
	"price": "95",
	"recommended_features": [],
	"required_features": []
}
